---
kind: type
id: T:Autodesk.Revit.UI.ThinLinesOptions
source: html/1d348cae-3e60-f890-5262-da795d927ea4.htm
---
# Autodesk.Revit.UI.ThinLinesOptions

A utility class containing setting related to the Thin Lines option which affects the display in the UI.

## Syntax (C#)
```csharp
public class ThinLinesOptions : IDisposable
```